import React from 'react'

function CookiesPolicy(){
    return(
        <div className='container-lend just-text'>
            <strong>ФАЙЛЫ COOKIE</strong>
<p>&nbsp;</p>
<p>За исключением случаев, указанных в настоящей Политике в отношении конфиденциальности и файлов Cookie, используемые нами файлы Cookie необходимы для функциональности и результативности <strong>AdWise</strong>, например, за счет придания большей эффективности работе <strong>AdWise</strong> и облегчения пользования функциональными возможностями и предоставляемыми услугами; эти функциональные и/или эксплуатационные файлы Cookie будут удалены с вашего устройства по завершении сеанса браузера (файлы Cookie сеанса). Мы не будем использовать информацию, хранящуюся в обязательных файлах Cookie, для каких&ndash;либо других целей, кроме как в случае крайней необходимости для предоставления Вам запрашиваемых услуг и функциональных возможностей.</p>
<p>&nbsp;</p>
<p>Мы можем использовать файлы Cookie для различных целей и тем самым улучшить ваше использование <strong>AdWise</strong>, например, запомнив ваши данные для входа в систему или предпочтения при предыдущих просмотрах <strong>AdWise</strong>, чтобы использовать их, когда вы возвращаетесь к <strong>AdWise</strong> в дальнейшем.</p>
<p>&nbsp;</p>
<p>Компания использует файлы Cookie для персонализации возможностей <strong>AdWise</strong> и, возможно, показа подходящей рекламы. Компания использует файлы Cookie и аналогичные технологии, в том числе идентификаторы мобильных устройств, для Вашей идентификации, повышения удобства работы с <strong>AdWise</strong>, повышения безопасности и, возможно, показа рекламы.</p>
<p>&nbsp;</p>
<p>Когда Вы впервые заходите в <strong>AdWise</strong>, Мы предлагаем Вам ознакомиться и принять Политику конфиденциальности и обработки файлов Cookie. При этом мы можем попросить Вас выбрать, на обработку каких категорий файлов Cookie Вы согласны (за исключением необходимых файлов Cookie, без которых нормальное функционирование <strong>AdWise</strong> невозможно), и подтвердить свое согласие с Политикой в обозначенных Вами пределах. Продолжая использование <strong>AdWise</strong>, Вы соглашаетесь на размещение в Вашем браузере и устройстве файлов в соответствии с настоящей Политикой.</p>
<p>&nbsp;</p>
<p>Мы используем технологии отслеживания во время сеанса и технологии постоянного отслеживания. Технологии отслеживания (например, файлы Cookie) могут быть постоянными (то есть они сохраняются на вашем компьютере, пока вы не удалите их) или временными (т.е. они сохраняются до тех пор, пока вы не закроете свой браузер).</p>
<p>&nbsp;</p>
<p>Некоторые из используемых нами файлов Cookie перечислены ниже. Данный список не является исчерпывающим, но дает представление об основных направлениях использования файлов Cookie. При посещении Вами <strong>AdWise</strong>, на вашем устройстве могут быть установлены описанные ниже Cookie&ndash;файлы.</p>
<p><strong>&nbsp;</strong></p>
<p><strong>Мы можем использовать как постоянные, так и сессионные файлы </strong><strong>Cookie, а также их разновидности для работы </strong><strong>AdWise:</strong></p>
<p>&nbsp;</p>
<p><strong>Обязательные файлы Cookie</strong> &ndash; необходимы для нормального функционирования <strong>AdWise</strong>. Компания может использовать обязательные файлы Cookie, чтобы аутентифицировать Пользователей, предотвращать мошенническое использование аккаунтов или обеспечивать отдельные функции <strong>AdWise</strong>. &nbsp;&nbsp;</p>
<p>&nbsp;</p>
<p><strong>Аналитические и эксплуатационные файлы Cookie</strong> &ndash; позволяют Компании распознавать Пользователей, а также отслеживают их переходы в <strong>AdWise</strong>, помогая усовершенствовать работу <strong>AdWise</strong>.&nbsp;</p>
<p>&nbsp;</p>
<p><strong>Функциональные файлы Cookie &ndash; </strong>используются для распознавания повторных посещений <strong>AdWise</strong>. Позволяют персонализировать содержимое <strong>AdWise</strong> для Пользователей, обращаться по имени и сохранять выбранные настройки (например, язык или регион).</p>
<p>&nbsp;</p>
<p><strong>Файлы Cookie для нацеливания</strong> &ndash; отслеживают процесс использования <strong>AdWise</strong>, открытые страницы и использованные ссылки. С помощью этой информации Компания делает <strong>AdWise</strong> и материалы более удобными и адаптирует их к конкретным предпочтениям. С этой же целью Компания также может передавать данные сведения третьим лицами.</p>
<p>&nbsp;</p>
<p><strong>Файлы Cookie могут использоваться для: </strong></p>
<p>&nbsp;</p>
<ul>
<li>Настройки содержимого веб&ndash;страниц <strong>AdWise</strong> в соответствии с предпочтениями Пользователей, а также для распознавания Пользователя;</li>
<li>Создания статистики, которая помогает понять, как именно посетители используют <strong>AdWise</strong>;</li>
<li>Поддержания сеанса Пользователя, совершившего авторизацию в <strong>AdWise</strong>, благодаря чему такие Пользователи не должны повторно вводить электронную почту и пароль на каждой веб&ndash;странице <strong>AdWise</strong>;</li>
</ul>
<p>&nbsp;</p>
<ul>
<li><strong>ВКЛЮЧЕНИЕ И ОТКЛЮЧЕНИЕ COOKIE И АНАЛОГИЧНЫЕ ФУНКЦИИ</strong></li>
</ul>
<p>&nbsp;</p>
<p>У вас есть возможность принять или отклонить все Cookie на всех сайтах, которые Вы посещаете, изменив настройки в Вашем интернет&ndash;браузере. Например, когда вы используете Internet Explorer версии 11.0 вы должны сделать следующее:</p>
<p>&nbsp;</p>
<ul>
<li>выбрать &laquo;Настройки&raquo;, затем &laquo;Свойства обозревателя&raquo;;</li>
<li>перейдите на вкладку &laquo;Конфиденциальность&raquo;;</li>
<li>используя мышку, выберете предпочтительные настройки.</li>
</ul>
<p>&nbsp;</p>
<p>Для каждого браузера необходимо использовать свои настройки для изменения и удаления Cookie. Пожалуйста, обратите внимание, что определенные функциональные возможности <strong>AdWise</strong> могут быть не будут доступны при отключении Cookie. Чтобы узнать подробнее о том, как отрегулировать или изменить настройки своего браузера, обратитесь к инструкциям браузера или по адресу www.aboutcookies.org либо <a href="http://www.allaboutcookies.org">www.allaboutcookies.org</a>.</p>
<p>&nbsp;</p>
<p>Если вы используете разные устройства для доступа к <strong>AdWise</strong> (напр., смартфон, планшет, компьютер и т.д.), вам следует позаботиться о том, чтобы каждый браузер на каждом устройстве был настроен в соответствии с вашими предпочтениями относительно файлов Cookie.</p>
        </div>
    )
}

export default CookiesPolicy