import React, {Component} from 'react';
import "./styles.css";
import varibles from "../../constants/varibles";
import axiosInstance from "../../agent/agent";

class BusinessStage extends Component {
    constructor(props) {
        super(props);

        this.state = {
            advantages: [
                {
                    picture: "/img/advantage/Group.png",
                    name: "Возможность<br/>оставлять чаевые<br/>сотрудникам-кассирам",
                },
                {
                    picture: "/img/advantage/Group (1).png",
                    name: "Поддерживается оплата<br/>товаров Apple Pay,<br/>Google Pay и наличными",
                },
                {
                    picture: "/img/advantage/Group (2).png",
                    name: "Отчёт о продажах через<br/>систему по любому<br/>периоду",
                },
            ],
            partners: [
                {
                    picture: "/img/buisnes/Group (3).png",
                    description: "Сеть автомоечных комплексов премиум класса в Гринвич и Пассаже",
                },
                {
                    picture: "/img/buisnes/image 1.png",
                    description: "На сегодняшний день сеть кофеен «Шоколадница» — одна из крупнейших и самых динамично развивающихся компаний в сфере ресторанного бизнеса в Москве, регионах России и странах СНГ.",
                },
                {
                    picture: "/img/buisnes/image 3.png",
                    description: "Дымные кальяны, вкусная еда, качественная музыка, вкусные коктейли",
                },
                {
                    picture: "/img/buisnes/IMG_7164 1.png",
                    description: "Lounge-bar \"СФЕРА\" в Академическом",
                },
            ],
        }
    }

    componentDidMount = () => {
        // this.getAdvantages();
        // this.getPartners();
    }

    getAdvantages = () => {
        axiosInstance.get('/administration/get-advantages').then((response) => {
            this.setState({
                advantages: response.data.data.advantages
            })
        })
    }
    getPartners = () => {
        axiosInstance.get('/administration/get-partners').then((response) => {
            this.setState({
                partners: response.data.data.partners
            })
        })
    }

    render() {
        const {
            advantages,
            partners
        } = this.state;

        return (
            <section className="container">

                <h1 className="title"><span>AdWise–Crm</span> настройте<br/>систему умных продаж</h1>

                <div className="business-stage__container">
                    <div className="stage">
                        <div className="stage__left">
                            <div className="stage__number">01</div>
                            <div className="stage__title">
                                Пройдите по ссылке<br/><a href="http://crm.adwise.cards"
                                                          target="_blank">crm.adwise.cards</a><br/>и заполните<br/>данные
                                компании
                            </div>
                        </div>
                        <div className="stage__right">
                            <img style={{maxWidth: 675}} src="/img/business-stage/stage-1.png"/>
                        </div>
                    </div>
                    <div className="stage nth">
                        <div className="stage-mini">
                            <div className="stage__number">02</div>
                            <div className="stage__title">
                                Соберите необходимый пакет<br/>документов и отправьте для<br/>регистрации на <a href="mailto:support@adwise.cards">support@adwise.cards</a>
                            </div>
                        </div>
                    </div>
                    <div className="stage right">
                        <div className="stage-mini">
                            <div className="stage__number">03</div>
                            <div className="stage__title">
                                Оплатите счёт и подпишите<br/>акт для предоставления<br/>доступа к CRM
                            </div>
                        </div>
                    </div>
                    <div className="stage nth full">
                        <div className="stage__left">
                            <div className="stage__number">04</div>
                            <div className="stage__title">
                                Готово! Теперь Вы<br/>можете создавать<br/>акции для<br/>привлечения<br/>клиентов через<br/>AdWise!
                            </div>
                        </div>
                        <div className="stage__right">
                            <img src="/img/business-stage/stage-4.png"/>
                        </div>
                    </div>
                </div>

                <div className="business-stage__advantages">
                    <h1>Наши преимущества</h1>

                    <div className="advantages__list">
                        {
                            advantages.map((advantage) => (
                                <div className="business-stage-advantage">
                                    <div className="business-stage-advantage__icon">
                                        <img style={{objectFit: 'contain'}} src={`${advantage.picture}`}/>
                                    </div>
                                    <div className="business-stage-advantage__title" dangerouslySetInnerHTML={{__html: advantage?.name}}/>
                                </div>
                            ))
                        }
                    </div>
                </div>

                <div className="business-stage__partners">
                    <h1>С нами уже работают</h1>

                    <div className="business-stage__partners-list">
                        {
                            partners.map((advantage) => (
                                <div className="business-stage-partner">
                                    <div className="business-stage-partner__logo">
                                        <img src={`${advantage.picture}`}/>
                                    </div>
                                    <div className="business-stage-partner__description">{advantage?.description}</div>
                                </div>
                            ))
                        }
                    </div>
                </div>

                <div className="business-stage__footer">

                    <svg width="624" height="86" viewBox="0 0 624 86" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M31.7374 45.2569L16.2993 23.4578C14.0098 20.2478 10.3971 18.5273 6.74237 18.5273C4.41089 18.5273 2.03741 19.2197 0 20.6674L27.3685 59.2931L31.6324 65.2936L31.7164 65.4195C31.7374 65.3985 31.7374 65.3985 31.7584 65.3985C31.8004 65.3565 31.8424 65.3355 31.8844 65.2936L36.1483 59.2931C37.1565 55.9571 36.6734 52.2015 34.51 49.1383L31.7374 45.2569Z" fill="#ED8E00"/>
                        <path d="M40.3295 40.7867L44.5933 46.7872L44.6774 46.8921L44.7614 46.7872L49.0042 40.7867L49.2143 40.493L58.0361 28.0304L66.8579 40.493L67.0679 40.7867L71.3108 46.7872L71.3948 46.8921L71.4788 46.7872L75.7427 40.7867L75.9527 40.493L103.09 2.14004C101.032 0.692367 98.6793 0 96.3269 0C92.6511 0 89.0384 1.72043 86.7699 4.93049L71.3948 26.6456L65.1985 17.8966L58.0361 7.78388L50.8736 17.8966L44.6564 26.6456L29.2602 4.93049C26.9708 1.72043 23.358 0 19.7033 0C17.3718 0 14.9984 0.692367 12.9609 2.14004L40.1194 40.472L40.3295 40.7867Z" fill="#8152E4"/>
                        <path d="M109.305 18.5049C105.63 18.5049 102.017 20.2253 99.7485 23.4354L84.3103 45.2344L81.5588 49.1159C79.3743 52.1791 78.8912 55.9347 79.9204 59.2706L84.1843 65.2711C84.2263 65.3131 84.2683 65.3341 84.3103 65.376C84.3313 65.376 84.3313 65.397 84.3524 65.397L84.4364 65.2711L88.7002 59.2706L116.048 20.6659C113.989 19.1973 111.637 18.5049 109.305 18.5049Z" fill="#ED8E00"/>
                        <path d="M71.4565 64.0757L65.3233 55.4106L58.1608 45.2979L58.0348 45.4657L57.9088 45.2979L50.7463 55.4106L44.6131 64.0757L41.8615 67.9571C39.6771 71.0203 39.194 74.7759 40.2232 78.1119L44.487 84.1124C44.5291 84.1543 44.5711 84.1753 44.6131 84.2173C44.6341 84.2383 44.6341 84.2383 44.6551 84.2383L44.7391 84.1124L49.003 78.1119L57.9298 65.5234L58.0558 65.3555L58.1818 65.5234L67.1086 78.1119L71.3725 84.1124L71.4565 84.2383C71.4775 84.2173 71.4775 84.2173 71.4985 84.2173C71.5406 84.1753 71.5826 84.1543 71.6246 84.1124L75.8884 78.1119C76.8966 74.7759 76.4135 71.0203 74.2501 67.9571L71.4565 64.0757Z" fill="#8152E4"/>
                        <path d="M189.476 64.7363H181.868L178 53.8406H154.984L151.116 64.7363H143.83L160.335 19.6063H172.971L189.476 64.7363ZM166.524 21.6693L157.305 47.458H175.679L166.524 21.6693ZM219.014 41.3332V17.0274H225.783V64.7363H219.014V55.1945C217.982 58.3322 216.306 60.8251 213.985 62.6732C211.707 64.4784 209.021 65.381 205.926 65.381C201.671 65.381 198.125 63.7478 195.288 60.4812C192.451 57.2146 191.033 53.1529 191.033 48.2961C191.033 43.4392 192.451 39.3775 195.288 36.111C198.125 32.8014 201.671 31.1467 205.926 31.1467C209.021 31.1467 211.707 32.0707 213.985 33.9189C216.306 35.7241 217.982 38.1955 219.014 41.3332ZM208.182 59.1273C211.32 59.1273 213.899 58.0958 215.919 56.0327C217.982 53.9696 219.014 51.3907 219.014 48.2961C219.014 45.1585 217.982 42.5581 215.919 40.495C213.899 38.4319 211.32 37.4004 208.182 37.4004C205.346 37.4004 202.939 38.4534 200.962 40.5595C198.984 42.6226 197.996 45.2015 197.996 48.2961C197.996 51.3477 198.984 53.9266 200.962 56.0327C202.939 58.0958 205.346 59.1273 208.182 59.1273ZM278.761 62.6732L287.593 19.6063H294.814L285.466 64.7363H271.927L263.545 21.7338L255.164 64.7363H241.818L232.47 19.6063H239.626L248.588 62.8022L256.969 19.6063H270.315L278.761 62.6732ZM300.309 25.2797C299.492 24.4631 299.084 23.4745 299.084 22.3141C299.084 21.1536 299.492 20.165 300.309 19.3484C301.168 18.5317 302.178 18.1234 303.339 18.1234C304.499 18.1234 305.488 18.5317 306.305 19.3484C307.121 20.165 307.53 21.1536 307.53 22.3141C307.53 23.4745 307.121 24.4631 306.305 25.2797C305.488 26.0964 304.499 26.5047 303.339 26.5047C302.178 26.5047 301.168 26.0964 300.309 25.2797ZM306.691 64.7363H299.922V31.7914H306.691V64.7363ZM312.343 56.0327L319.112 54.6143C319.714 58.1387 322.121 59.901 326.333 59.901C328.482 59.901 330.201 59.4926 331.491 58.676C332.823 57.8164 333.489 56.7419 333.489 55.4524C333.489 54.077 332.802 53.0455 331.426 52.3578C330.051 51.6271 328.375 51.1113 326.398 50.8105C324.42 50.4666 322.422 50.0583 320.402 49.5855C318.425 49.1127 316.748 48.1886 315.373 46.8132C313.997 45.3949 313.31 43.5037 313.31 41.1397C313.31 38.26 314.535 35.8746 316.985 33.9834C319.478 32.0922 322.594 31.1467 326.333 31.1467C330.072 31.1467 333.124 31.9848 335.488 33.661C337.895 35.3373 339.335 37.6153 339.808 40.495L333.038 41.9134C332.522 38.389 330.287 36.6267 326.333 36.6267C324.528 36.6267 323.045 37.0136 321.885 37.7872C320.724 38.5609 320.144 39.5709 320.144 40.8174C320.144 41.9349 320.638 42.8375 321.627 43.5252C322.615 44.2129 323.862 44.6642 325.366 44.8791C326.87 45.094 328.482 45.4164 330.201 45.8462C331.964 46.276 333.597 46.7703 335.101 47.329C336.606 47.8448 337.852 48.7904 338.841 50.1658C339.829 51.5412 340.323 53.2604 340.323 55.3235C340.323 58.2032 338.969 60.6101 336.262 62.5443C333.597 64.4355 330.287 65.381 326.333 65.381C322.422 65.381 319.241 64.5429 316.791 62.8667C314.341 61.1904 312.858 58.9124 312.343 56.0327ZM361.869 31.1467C367.156 31.1467 371.454 33.0378 374.763 36.8202C378.073 40.6025 379.427 45.18 378.825 50.5526H351.554C352.026 53.2174 353.251 55.388 355.228 57.0642C357.206 58.6975 359.591 59.5141 362.385 59.5141C364.534 59.5141 366.446 58.9984 368.123 57.9668C369.842 56.8923 371.174 55.4524 372.12 53.6472L377.793 56.1616C376.332 58.9554 374.247 61.1904 371.54 62.8667C368.832 64.5429 365.716 65.381 362.191 65.381C357.248 65.381 353.101 63.7478 349.748 60.4812C346.396 57.2146 344.72 53.1529 344.72 48.2961C344.72 43.4392 346.353 39.3775 349.619 36.111C352.929 32.8014 357.012 31.1467 361.869 31.1467ZM361.869 37.0136C359.376 37.0136 357.206 37.7872 355.357 39.3345C353.552 40.8389 352.349 42.816 351.747 45.2659H371.991C371.432 42.816 370.229 40.8389 368.381 39.3345C366.575 37.7872 364.405 37.0136 361.869 37.0136Z" fill="#25233E"/>
                        <path d="M432.109 19.0799C434.756 15.2714 439.1 13.0005 443.738 13.0005L583.28 13.0005L545.171 67.8238C542.524 71.6323 538.18 73.9032 533.542 73.9032H394L432.109 19.0799Z" fill="#8152E4"/>
                        <path d="M588.615 19.0794C591.262 15.2709 595.606 13 600.244 13L604.171 13L566.062 67.8233C563.415 71.6318 559.071 73.9027 554.433 73.9027H550.506L588.615 19.0794Z" fill="#8152E4"/>
                        <path d="M608.443 19.0794C611.09 15.2709 615.434 13 620.072 13L623.999 13L585.891 67.8233C583.243 71.6318 578.899 73.9027 574.261 73.9027H570.334L608.443 19.0794Z" fill="#ED8E00"/>
                        <path d="M440.108 55.6033C436.912 52.4377 435.314 48.5417 435.314 43.9151C435.314 39.2885 436.912 35.3925 440.108 32.2269C443.334 29.0614 447.306 27.4786 452.024 27.4786C455.433 27.4786 458.447 28.3765 461.064 30.1724C463.682 31.9378 465.584 34.1293 466.771 36.747L462.114 38.5733C461.201 36.6557 459.847 35.1033 458.051 33.9163C456.286 32.7292 454.277 32.1356 452.024 32.1356C448.767 32.1356 446.028 33.2771 443.806 35.5599C441.614 37.8123 440.519 40.5974 440.519 43.9151C440.519 47.2328 441.614 50.0331 443.806 52.316C446.028 54.5684 448.767 55.6946 452.024 55.6946C454.277 55.6946 456.286 55.101 458.051 53.914C459.847 52.7269 461.201 51.1746 462.114 49.257L466.771 51.0832C465.584 53.7009 463.682 55.9077 461.064 57.7035C458.447 59.4689 455.433 60.3516 452.024 60.3516C447.306 60.3516 443.334 58.7688 440.108 55.6033ZM487.299 47.2024L495.882 59.895H489.81L481.455 47.4763H476.296V59.895H471.228V27.9352H484.468C487.603 27.9352 490.145 28.8636 492.093 30.7203C494.071 32.5465 495.06 34.875 495.06 37.7058C495.06 40.0495 494.36 42.0888 492.96 43.8238C491.56 45.5588 489.673 46.685 487.299 47.2024ZM484.468 32.4552H476.296V42.865H484.468C486.051 42.865 487.344 42.378 488.349 41.404C489.353 40.3995 489.856 39.1516 489.856 37.6601C489.856 36.1687 489.353 34.9359 488.349 33.9619C487.344 32.9575 486.051 32.4552 484.468 32.4552ZM533.729 27.9352V59.895H528.935V29.031L521.264 59.895H512.361L504.691 29.031V59.895H499.897V27.9352H509.257L516.836 58.6166L524.46 27.9352H533.729Z" fill="white"/>
                    </svg>

                    <a href="https://crm.adwise.cards/" target="_blank">Зарегистрироваться</a>

                </div>

            </section>
        );
    }
}

export default BusinessStage
